/**********************************************************************
*																																			*
*		Файл параметров для МУК ЗРУ зав. № ________		*
*																																			*
***********************************************************************/

#ifndef PARAMETERS_ZRU01002_H
#define PARAMETERS_ZRU01002_H

// .............................................................................................................................
// 						//ДТ1		//ДТ2
float cUsm[3][2] =  {1.40895188, 1.42194116, 		//МК1		//(В) Измеренное напряжение средней точкой (смещение) для МУКов					
										 1.41734922, 1.43122959,		//МК2
					           1.41734922, 1.43122959			//МК3		
										};
										
// ............................ Датчики токов, напряжения и температуры ЗРУ.....................
						// 		//ДТ1	//ДТ2
volatile float KoefZar [3][2] = {38.747, 39.249,	//МК1	 												// Коэффициенты масштабирования для Тока Заряда;
								                 38.421, 38.854,	//МК2	
								                 38.492, 38.854	    //МК3
																};
volatile float KoefRazr[3][2] = {38.291, 38.443, 	//МК1 												// Коэффициенты масштабирования для Тока Разряда;
								                 37.455, 37.832,	//МК2	
								                 37.455, 37.714 	//МК3
																};

//									  //МК1		   //МК2		//МК3
volatile float Koef_k_Uab_zru[3] = {80.12353048, 79.32761391, 79.65698552}; //коэффициент Uаб_зру
volatile float Koef_b_Uab_zru[3] = {0.019991015, 0.412482803, 0.291411502}; //смещение Uаб_зру 

volatile float Koef_k_dtemp1[3] = {306.49043,  522.5110138, 470.6497676}; //коэффициент Темп1
volatile float Koef_b_dtemp1[3] = {-244.0829311, -435.9053138,  -390.1523526}; //смещение Темп1 

volatile float Koef_k_dtemp2[3] = {337.7605514,  551.4425561, 549.8623265}; //коэффициент Темп2
volatile float Koef_b_dtemp2[3] = {-271.302048, -461.0104593, -459.639226}; //смещение Темп2 

//volatile float KoefIzarT[3][2] 	= {0, 		0, 		 0,
//																	 0, 		0, 		 0}; 																// Коэффициенты масштабирования для Тока Заряда;
//volatile float KoefIrazT[3][2] 	= {0, 		0, 		 0,
//																	 0.289, 0.289, 0.289}; 														// Коэффициенты масштабирования для Тока Разряда;

//volatile float KoefIzarABT[3] = {0.07, 0.07, 0.07}; 																// Коэффициенты масштабирования для Тока Заряда;
//volatile float KoefIrazABT[3] = {0.08, 0.08, 0.08}; 																// Коэффициенты масштабирования для Тока Разряда;


//**************************************************************************************************
			float	AUcc[3]	= {3.269, 3.360, 3.266};		// (В) Опорное напряжение АЦП МУК1, МУК2, МУК3
const float	Uref[3]	= {2.986, 3.031, 3.019};		// (В) Прецизионное напряжение АЦП МУК1, МУК2, МУК3 на PD0

																 
#endif
// end of parameters.h
