/**********************************************************************
*																																			*
*		Файл параметров для МУК ЗРУ зав. № ________		*
*																																			*
***********************************************************************/

#ifndef PARAMETERS_ZRU01002_H
#define PARAMETERS_ZRU01002_H

// .............................................................................................................................
// 						//ДТ1		//ДТ2
float cUsm[3][2] =  {1.41595188, 1.43494116, 		//МК1		//(В) Измеренное напряжение средней точкой (смещение) для МУКов					
										 1.42534922, 1.43922959,		//МК2
					           1.42634922, 1.44522959			//МК3		
										};
										
// ............................ Датчики токов, напряжения и температуры ЗРУ.....................
						// 		//ДТ1	//ДТ2
//volatile float KoefZar [3][2] = {38.747, 39.249,	//МК1	 												// Коэффициенты масштабирования для Тока Заряда;
//								                 38.421, 38.854,	//МК2	
//								                 38.492, 38.854	    //МК3
//																};
volatile float KoefZar [3][2] = {42.947, 42.949,	//МК1	 												// Коэффициенты масштабирования для Тока Заряда;
								                 42.947, 43.949,	//МК2	
								                 42.947, 42.949	    //МК3
																};

volatile float KoefRazr[3][2] = {38.291, 38.443, 	//МК1 												// Коэффициенты масштабирования для Тока Разряда;
								                 37.455, 37.832,	//МК2	
								                 37.455, 37.714 	//МК3
																};

//									                 //МК1		   //МК2		//МК3
volatile float Koef_k_Uab_zru[3] = {80.9434, 80.4241, 80.4241}; //коэффициент Uаб_зру
volatile float Koef_b_Uab_zru[3] = {-3.1515, -3.305063, -3.305063}; //смещение Uаб_зру 
//volatile float Koef_b_Uab_zru[3] = {-0.314039, -0.314027, -0.320665}; //смещение Uаб_зру 

volatile float Koef_k_dtemp1[3] = {64.2857,  58.9286, 58.9286}; //коэффициент Темп1
volatile float Koef_b_dtemp1[3] = {-90.21429, -81.4285,  -81.4285}; //смещение Темп1 

volatile float Koef_k_dtemp2[3] = {64.2857,  58.9286, 58.9286}; //коэффициент Темп2
volatile float Koef_b_dtemp2[3] = {-90.21429, -81.4285,  -81.4285}; //смещение Темп2 

//volatile float KoefIzarT[3][2] 	= {0, 		0, 		 0,
//																	 0, 		0, 		 0}; 																// Коэффициенты масштабирования для Тока Заряда;
//volatile float KoefIrazT[3][2] 	= {0, 		0, 		 0,
//																	 0.289, 0.289, 0.289}; 														// Коэффициенты масштабирования для Тока Разряда;

volatile float KoefIzarABT[3] = {-0.06, -0.06, -0.06}; 																// Коэффициенты масштабирования для Тока Заряда;
//volatile float KoefIrazABT[3] = {0.241, 0.28, 0.265}; 																// Коэффициенты масштабирования для Тока Разряда;
volatile float KoefIrazABT[3] = {-0.125, -0.125, -0.125}; 																// Коэффициенты масштабирования для Тока Разряда;


//**************************************************************************************************
			float	AUcc[3]	= {3.269, 3.360, 3.266};		// (В) Опорное напряжение АЦП МУК1, МУК2, МУК3
const float	Uref[3]	= {2.986, 3.031, 3.019};		// (В) Прецизионное напряжение АЦП МУК1, МУК2, МУК3 на PD0

																 
#endif
// end of parameters.h
